app/controllers/categories_controller.rb

INSERT INTO `categories` (`name`, `updated_at`, `created_at`) VALUES('notebook', '2009-12-09 12:06:42', '2009-12-09 12:06:42')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save