app/controllers/comments_controller.rb

INSERT INTO `comments` (`updated_at`, `product_id`, `content`, `user_id`, `created_at`) VALUES('2009-12-13 07:02:01', NULL, 'dfdsf', NULL, '2009-12-13 07:02:01')
---
  def create
    @comment = Comment.new(params[:comment])
    @comment.user_id=session[:user_id]
    respond_to do |format|
      if @comment.save