app/controllers/daily_reports_controller.rb

  def index
    @daily_reports = DailyReport.all
---
SELECT * FROM `daily_reports`

  def show
    @daily_report = DailyReport.find(params[:id])
---
SELECT * FROM `daily_reports` WHERE (`daily_reports`.`id` = 1)

  def edit
    @daily_report = DailyReport.find(params[:id])
---
SELECT * FROM `daily_reports` WHERE (`daily_reports`.`id` = 1)

  def create
    @daily_report = DailyReport.new(params[:daily_report])

    respond_to do |format|
      if @daily_report.save
---
INSERT INTO `daily_reports` (`updated_at`, `income`, `created_at`) VALUES('2009-12-18 11:41:00', 5000.0, '2009-12-18 11:41:00')

  def update
    @daily_report = DailyReport.find(params[:id])

    respond_to do |format|
      if @daily_report.update_attributes(params[:daily_report])
---
SELECT * FROM `daily_reports` WHERE (`daily_reports`.`id` = 1)
UPDATE `daily_reports` SET `updated_at` = '2009-12-24 15:57:23', `created_at` = '2009-01-22 05:05:18' WHERE `id` = 1

  def destroy
    @daily_report = DailyReport.find(params[:id])
    @daily_report.destroy
---
SELECT * FROM `daily_reports` WHERE (`daily_reports`.`id` = 13)
DELETE FROM `daily_reports` WHERE `id` = 13