app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT * FROM `orders`

  def edit
    @order = Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 1)

  def create
    @car=find_car
    @order = Order.new(params[:order])
    @order.add_line_item_from_car(@car)

     Order.transaction do
        @order.save!
---
INSERT INTO `line_items` (`updated_at`, `order_id`, `total_price`, `quantity`, `product_id`, `created_at`) VALUES('2009-12-10 10:40:42', 1, 16000.0, 2, 1, '2009-12-10 10:40:42')
INSERT INTO `orders` (`name`, `updated_at`, `pay_type`, `address`, `email`, `created_at`) VALUES('zhuzhe', '2009-12-10 10:40:42', 'check', 'ddddddddddddddddddddddddddddddddddddddddddddddddddddddddd', 'zhuzheiswho@sina.com', '2009-12-10 10:40:42')

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 2)
DELETE FROM `orders` WHERE `id` = 2