app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])
    upload
    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `image_url`, `updated_at`, `price`, `description`, `created_at`) VALUES('macbook', '/images/macbook.jpg', '2009-12-09 11:45:57', 8000.0, ' The object in the params hash is an instance of a subclass of IO. Depending on the size of the uploaded file it may in fact be a StringIO or an instance of File backed by a temporary file. In both cases the object will have an original_filename attribute containing the name the file had on the user’s computer and a content_type attribute containing the MIME type of the uploaded file. The following snippet saves the uploaded content in #{Rails.root}/public/uploads under the same name as the original file (assuming the form was the one in the previous example).', '2009-12-09 11:45:57')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])&&upload
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)
UPDATE `products` SET `updated_at` = '2009-12-11 15:52:25', `image_url` = '/image/hp.jpg' WHERE `id` = 4

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT * FROM `products` WHERE (`products`.`id` = 5)
DELETE FROM `products` WHERE `id` = 5

  def find_products_with_category
    category= Category.find(params[:category_id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)

  def latest
    @products=Product.all(:conditions=>{:created_at=>(Time.now.midnight-7.day)..Time.now});
---
SELECT * FROM `products` WHERE (`products`.`created_at` BETWEEN '2009-12-06 00:00:00' AND '2009-12-13 00:00:00')

  def search

    @products=Product.all(:conditions=>"name like '%#{params[:key]}%'")
---
SELECT * FROM `products` WHERE (name like '%mac%')