app/controllers/store_controller.rb

  def add_to_car
    @car=find_car
    product=Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def remove_from_car
    @car=session[:car]
    @car.remove_product(Product.find(params[:id]) )
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def edit_quantity
    @car=session[:car]
    current_item=@car.items.find{|item|item.product==Product.find(params[:car_item][:product_id])}
---
SELECT * FROM `products` WHERE (`products`.`id` = 3)