app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `hashed_password`, `admin`, `created_at`, `email`) VALUES('testmailer', '375622000.819597996341442', '2009-12-12 06:39:45', 'ca60a03663ecec5a31de50a430ac285e9d6f01cb', 0, '2009-12-12 06:39:45', 'zhuzheiswho@sina.com')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
UPDATE `users` SET `hashed_password` = 'f45bdd8515fbac75f50a07233f3bec30a24c47f1', `salt` = '372557000.503341007631933', `email` = 'zhuzheiswho@sina.com', `updated_at` = '2009-12-12 06:18:11' WHERE `id` = 2

  def destroy
    @user = User.find(params[:id])
    begin
    @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
DELETE FROM `users` WHERE `id` = 1